In [1]:
import pandas as pd
import os
from datetime import datetime
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

# SET WORK DERC

#### For my Mac
# os.chdir('//Users//patricklee//Desktop//파이썬//DACON//2020DACON_CUP') 

### For my Desktop
os.chdir('C://Users//BIS_COM//data//dacon//2020')

In [2]:
train_df = pd.read_csv(r'./train.csv',encoding='cp949',parse_dates=['DateTime'])
login_df = pd.read_csv(r'./info_login.csv',parse_dates=['c_time'],index_col=0)
user_df = pd.read_csv(r'./info_user.csv',parse_dates=['c_time'],index_col=0)
compe_df = pd.read_csv(r'./info_competition.csv',encoding='cp949',parse_dates=['period_start','period_end'],index_col=0)
sub_df = pd.read_csv(r'./info_submission.csv',encoding='cp949',index_col=0,parse_dates=['c_time'])

C:\Users\BIS_COM\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (4,5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
all_data = [train_df,login_df,user_df,compe_df,sub_df]
just_data = [login_df,user_df,compe_df]
user_data = [user_df,login_df]

In [4]:
for i in all_data :
    print('-'*50)
    i.info()

--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19008 entries, 0 to 19007
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  19008 non-null  datetime64[ns]
 1   사용자       19008 non-null  int64
 2   세션        19008 non-null  int64
 3   신규방문자     19008 non-null  int64
 4   페이지뷰      19008 non-null  int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 742.6 KB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Float64Index: 151428 entries, 0.0 to nan
Data columns (total 5 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   login_id  148999 non-null  float64
 1   user_id   141585 non-null  float64
 2   c_time    148999 non-null  datetime64[ns]
 3   platform  64654 non-null   object
 4   browser   64654 non-null   object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 6.9+ MB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Float64Index: 22103 entries, 0.0 to nan
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       21692 non-null  float64
 1   c_time                   21692 non-null  datetime64[ns]
 2   entered_competition_cnt  21692 non-null  float64
 3   code_share_cnt           21692 non-null  float64
 4   talk_board_cnt           21692 non-null  float64
 5   country_code             21692 non-null  float64
 6   python_level             21692 non-null  float64
 7   ds_level                 21692 non-null  float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 1.5 MB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 48 entries, 0 to 109
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   cpt_id            48 non-null     int64
 1   is_official       48 non-null     int64
 2   period_start      48 non-null     datetime64[ns]
 3   period_end        48 non-null     datetime64[ns]
 4   name              48 non-null     object
 5   name_eng          25 non-null     object
 6   keyword           48 non-null     object
 7   keyword_eng       24 non-null     object
 8   participants      48 non-null     int64
 9   max_team_member   48 non-null     int64
 10  max_file_per_day  48 non-null     int64
 11  prize             48 non-null     int64
 12  prize_info        32 non-null     object
 13  merge_deadline    48 non-null     object
 14  winner_show       48 non-null     int64
dtypes: datetime64[ns](2), int64(7), object(6)
memory usage: 6.0+ KB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Float64Index: 103375 entries, 0.0 to nan
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   sub_id   101587 non-null  float64
 1   cpt_id   101587 non-null  float64
 2   team_id  101501 non-null  float64
 3   user_id  99262 non-null   float64
 4   c_time   101587 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(4)
memory usage: 4.7 MB

In [5]:
login_df['c_time'] = login_df['c_time'].dt.date
user_df['c_time'] = user_df['c_time'].dt.date
compe_df['period_start'] = compe_df['period_start'].dt.date
compe_df['period_end'] = compe_df['period_end'].dt.date

# User Data Reshape

In [6]:
user_df.sort_values(by='c_time',axis=0)
user_df

,id,c_time,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
0.0,15994.0,2017-05-02,94.0,306.0,477.0,82.0,1.0,1.0
1.0,19195.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
2.0,16339.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
3.0,7290.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0
4.0,21287.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0
...,...,...,...,...,...,...,...,...
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
user_df.isnull().sum()

id                         411
c_time                     411
entered_competition_cnt    411
code_share_cnt             411
talk_board_cnt             411
country_code               411
python_level               411
ds_level                   411
dtype: int64

In [8]:
user_df.shape

(22103, 8)

In [9]:
user_df = user_df.dropna(axis=0, how='any')

In [10]:
user_df.shape

(21692, 8)

In [11]:
22103 - 21692

411

In [12]:
user_df.isnull().sum()

id                         0
c_time                     0
entered_competition_cnt    0
code_share_cnt             0
talk_board_cnt             0
country_code               0
python_level               0
ds_level                   0
dtype: int64

In [13]:
user_df.head()

,id,c_time,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
0.0,15994.0,2017-05-02,94.0,306.0,477.0,82.0,1.0,1.0
1.0,19195.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
2.0,16339.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
3.0,7290.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0
4.0,21287.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0

In [14]:
time = user_df['c_time'].unique()
uniq_ds = user_df.groupby(user_df['c_time'])['id'].nunique()
count_id = user_df.groupby(user_df['c_time'])['id'].count()
count_com = user_df.groupby(user_df['c_time'])['entered_competition_cnt'].count()
count_cod = user_df.groupby(user_df['c_time'])['code_share_cnt'].count()
count_tak = user_df.groupby(user_df['c_time'])['talk_board_cnt'].count()
count_con = user_df.groupby(user_df['c_time'])['country_code'].count()
uniq_con = user_df.groupby(user_df['c_time'])['country_code'].nunique()
count_pyt = user_df.groupby(user_df['c_time'])['python_level'].mean()
count_ds = user_df.groupby(user_df['c_time'])['ds_level'].mean()
df_list = [time, uniq_ds, count_id, count_com, count_cod, count_tak, count_con, uniq_con, count_pyt, count_ds]
col_list = ['time', 'uniq_id', 'count_id', 'count_com', 'count_cod', 'count_tak', 'count_con', 'uniq_con', 'count_pyt', 'count_ds']

In [15]:
new_user_df = pd.DataFrame(data=df_list)
new_user_df=new_user_df.T

In [16]:
new_user_df.columns=[col_list]
new_user_df.head()

,time,uniq_id,count_id,count_com,count_cod,count_tak,count_con,uniq_con,count_pyt,count_ds
0,2017-05-02,1,1,1,1,1,1,1,1,1
1,2018-08-08,6,6,6,6,6,6,1,1,1
2,2018-08-09,1,1,1,1,1,1,1,1,1
3,2018-08-10,2,2,2,2,2,2,1,1,1
4,2018-08-12,1,1,1,1,1,1,1,1,1

In [17]:
print(np.array_equal(uniq_ds, count_id))
print(np.array_equal(uniq_ds, count_com))
print(np.array_equal(uniq_ds, count_cod))
print(np.array_equal(uniq_ds, count_tak))
print(np.array_equal(uniq_ds, count_con))
print(np.array_equal(uniq_con, count_con))
print(np.array_equal(count_pyt, count_ds))

True
True
True
True
True
False
False

In [18]:
df_list = [time, count_id, uniq_con, count_pyt, count_ds]
col_list = ['time', 'count_id', 'uniq_con', 'mean_pyt', 'mean_ds']

new_user_df = pd.DataFrame(data=df_list)
new_user_df=new_user_df.T
new_user_df.columns=[col_list]
new_user_df.head()

         time count_id uniq_con mean_pyt mean_ds
0  2017-05-02        1        1        1       1
1  2018-08-08        6        1        1       1
2  2018-08-09        1        1        1       1
3  2018-08-10        2        1        1       1
4  2018-08-12        1        1        1       1

# Login Data reshape

In [19]:
login_df.isnull().sum()

login_id     2429
user_id      9843
c_time       2429
platform    86774
browser     86774
dtype: int64

In [20]:
login_df.sort_values('c_time')

      login_id  user_id      c_time   platform                 browser
0.0    14196.0  19195.0  2018-09-23  Windows 8  Internet Explorer 10.0
20.0   14322.0  19221.0  2018-09-23    Windows    Chrome 69.0.3497.100
21.0   14323.0   9771.0  2018-09-23      Apple    Chrome 69.0.3497.100
22.0   14338.0     91.0  2018-09-23      Apple             Safari 12.0
23.0   14346.0  17298.0  2018-09-23    Windows    Chrome 68.0.3440.106
...        ...      ...         ...        ...                     ...
NaN        NaN      NaN         NaN        NaN                     NaN
NaN        NaN      NaN         NaN        NaN                     NaN
NaN        NaN      NaN         NaN        NaN                     NaN
NaN        NaN      NaN         NaN        NaN                     NaN
NaN        NaN      NaN         NaN        NaN                     NaN

[151428 rows x 5 columns]

In [21]:
login_drop_df = login_df.copy()
# login_drop_df['c_time'] = login_drop_df['c_time'].dropna
# login_drop_df.head()

In [22]:
login_drop_df=login_drop_df.dropna(how='all')
login_drop_df.head()

     login_id  user_id      c_time   platform                 browser
0.0   14196.0  19195.0  2018-09-23  Windows 8  Internet Explorer 10.0
1.0   14234.0  22045.0  2018-09-23    Windows     Chrome 67.0.3396.99
2.0   14256.0   8790.0  2018-09-23    Windows    Chrome 69.0.3497.100
3.0   14278.0      NaN  2018-09-23    Windows    Chrome 69.0.3497.100
4.0   14279.0      NaN  2018-09-23    Windows    Chrome 69.0.3497.100

In [23]:
login_drop_df.isnull().sum()

login_id        0
user_id      7414
c_time          0
platform    84345
browser     84345
dtype: int64

In [24]:
login_drop_df['user_id'] = login_drop_df['user_id'].fillna(-99)
login_drop_df['platform'] = login_drop_df['platform'].fillna('Other')
login_drop_df['browser'] = login_drop_df['browser'].fillna('Other')

In [25]:
login_drop_df.isnull().sum()

login_id    0
user_id     0
c_time      0
platform    0
browser     0
dtype: int64

In [26]:
login_drop_df.head()

     login_id  user_id      c_time   platform                 browser
0.0   14196.0  19195.0  2018-09-23  Windows 8  Internet Explorer 10.0
1.0   14234.0  22045.0  2018-09-23    Windows     Chrome 67.0.3396.99
2.0   14256.0   8790.0  2018-09-23    Windows    Chrome 69.0.3497.100
3.0   14278.0    -99.0  2018-09-23    Windows    Chrome 69.0.3497.100
4.0   14279.0    -99.0  2018-09-23    Windows    Chrome 69.0.3497.100

In [27]:
count_login_id = login_drop_df.groupby(login_drop_df['c_time'])['login_id'].count()
uniq_login_id = login_drop_df.groupby(login_drop_df['c_time'])['login_id'].nunique()
count_user_id = login_drop_df.groupby(login_drop_df['c_time'])['user_id'].count()
uniq_user_id = login_drop_df.groupby(login_drop_df['c_time'])['user_id'].nunique()
count_plat = login_drop_df.groupby(login_drop_df['c_time'])['platform'].count()
count_brow = login_drop_df.groupby(login_drop_df['c_time'])['browser'].count()

In [28]:
df_list = [time, count_login_id, uniq_login_id, count_user_id, uniq_user_id, count_plat,count_brow]
col_list = ['time', 'count_login_id', 'uniq_login_id', 'count_user_id', 'uniq_user_id', 'count_plat','count_brow']

new_login_df = pd.DataFrame(data=df_list)
new_login_df = new_login_df.T
new_login_df.columns=[col_list]
new_login_df.head()

,time,count_login_id,uniq_login_id,count_user_id,uniq_user_id,count_plat,count_brow
0,2017-05-02,35,35,35,19,35,35
1,2018-08-08,30,30,30,22,30,30
2,2018-08-09,18,18,18,14,18,18
3,2018-08-10,48,48,48,31,48,48
4,2018-08-12,31,31,31,24,31,31

In [29]:
print(np.array_equal(count_login_id, uniq_login_id))
print(np.array_equal(count_login_id, count_user_id))
print(np.array_equal(count_login_id, count_plat))
print(np.array_equal(count_login_id, count_brow))

True
True
True
True

In [36]:
df_list = [count_login_id, uniq_user_id]
col_list = ['count_login_id','uniq_user_id']

new_login_df = pd.DataFrame(data=df_list)
new_login_df = new_login_df.T
new_login_df.columns=[col_list]
new_login_df.head()

           count_login_id uniq_user_id
c_time
2018-09-23             35           19
2018-09-24             30           22
2018-09-25             18           14
2018-09-26             48           31
2018-09-27             31           24

In [31]:
pd.concat([new_login_df,new_user_df],axis=1)

,time,count_login_id,uniq_user_id,time,count_id,uniq_con,mean_pyt,mean_ds
0,2017-05-02,35,19,2017-05-02,1,1,1,1
1,2018-08-08,30,22,2018-08-08,6,1,1,1
2,2018-08-09,18,14,2018-08-09,1,1,1,1
3,2018-08-10,48,31,2018-08-10,2,1,1,1
4,2018-08-12,31,24,2018-08-12,1,1,1,1
...,...,...,...,...,...,...,...,...
838,2020-12-04,None,None,2020-12-04,42,2,1,1
839,2020-12-05,None,None,2020-12-05,31,1,1,1
840,2020-12-06,None,None,2020-12-06,24,1,1,1
841,2020-12-07,None,None,2020-12-07,70,3,1,1
842,2020-12-08,None,None,2020-12-08,70,1,1,1

In [37]:
new_login_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 808 entries, 2018-09-23 to 2020-12-08
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   (count_login_id,)  808 non-null    int64
 1   (uniq_user_id,)    808 non-null    int64
dtypes: int64(2)
memory usage: 58.9+ KB

In [33]:
new_user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 843 entries, 0 to 842
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   (time,)      843 non-null    object
 1   (count_id,)  843 non-null    object
 2   (uniq_con,)  843 non-null    object
 3   (mean_pyt,)  843 non-null    object
 4   (mean_ds,)   843 non-null    object
dtypes: object(5)
memory usage: 33.1+ KB

In [35]:
df_list = [count_login_id, uniq_user_id]
col_list = ['count_login_id','uniq_user_id']

new_login_df = pd.DataFrame(data=df_list)
new_login_df = new_login_df.T
new_login_df.columns=[col_list]
new_login_df.head()

           count_login_id uniq_user_id
c_time
2018-09-23             35           19
2018-09-24             30           22
2018-09-25             18           14
2018-09-26             48           31
2018-09-27             31           24

# Test

In [39]:
user_df.columns

Index(['id', 'c_time', 'entered_competition_cnt', 'code_share_cnt',
       'talk_board_cnt', 'country_code', 'python_level', 'ds_level'],
      dtype='object')

In [40]:
df_dict = dict( list( user_df.groupby(['c_time','id'])))

In [43]:
df_dict[('2018-09-25')]

KeyError: '2018-09-25'

In [ ]:
count_id = user_df.groupby(user_df['c_time'])['id'].count()